Repository: vemore/countscore
Catalog: lib/l10n/app_*.arb
Languages: ar, hi

# homeTitle
source: Home
ar: الرئيسية
hi: होम

# playersListTitle
source: Players List
ar: قائمة اللاعبين
hi: खिलाड़ियों की सूची

# gameTypesTitle
source: Game Types
ar: أنواع الألعاب
hi: खेल के प्रकार

# settingsTitle
source: Settings
ar: الإعدادات
hi: सेटिंग्स

# aboutTitle
source: About
ar: حول
hi: के बारे में

source: New Game
ar: لعبة جديدة
hi: नया खेल

source: No games
ar: لا توجد ألعاب
hi: कोई खेल नहीं

source: No games of this type
ar: لا توجد ألعاب من هذا النوع
hi: इस प्रकार का कोई खेल नहीं

# createFirstGame
source: Create your first game
ar: أنشئ لعبتك الأولى
hi: अपना पहला खेल बनाएं

source: Created on
ar: أنشئت في
hi: बनाया गया

source: New with same players
ar: جديدة بنفس اللاعبين
hi: उन्हीं खिलाड़ियों के साथ नया

# newGameSuffix
source: (new)
hi: (नया)

source: Rename
ar: إعادة تسمية
hi: नाम बदलें

source: Delete
ar: حذف
hi: हटाएं

source: Confirm deletion
ar: تأكيد الحذف
hi: हटाने की पुष्टि करें

# confirmDeleteGame
source: Do you really want to delete the game "{name}"?
ar: هل تريد حقاً حذف اللعبة "{name}"؟
hi: क्या आप वाकई "{name}" खेल को हटाना चाहते हैं?

source: Cancel
ar: إلغاء
hi: रद्द करें

source: Rename game
ar: إعادة تسمية اللعبة
hi: खेल का नाम बदलें

source: Game name
ar: اسم اللعبة
hi: खेल का नाम

source: Save
ar: حفظ
hi: सहेजें

source: Filter by game type
ar: تصفية حسب نوع اللعبة
hi: खेल के प्रकार से फ़िल्टर करें

source: All games
ar: جميع الألعاب
hi: सभी खेल

source: Filter games
hi: गेम फ़िल्टर करें

# applyFilter
source: Apply
hi: लागू करें

# resetFilter
source: Reset
hi: रीसेट करें

# selectGameType
source: Select a game type
hi: एक गेम प्रकार चुनें

source: Game type
ar: نوع اللعبة
hi: खेल का प्रकार

source: Loading game types...
ar: جاري تحميل أنواع الألعاب...
hi: खेल के प्रकार लोड हो रहे हैं...

source: Win rule
ar: قاعدة الفوز
hi: जीत का नियम

source: Lowest score wins
ar: أقل نتيجة تفوز
hi: सबसे कम स्कोर जीतता है

source: Highest score wins
ar: أعلى نتيجة تفوز
hi: सबसे अधिक स्कोर जीतता है

# lowestScoreExample
source: Ex: Golf, Hearts
ar: مثال: الغولف، القلوب
hi: उदा: गोल्फ, हार्ट्स

# highestScoreExample
source: Ex: Rummy, Bridge
ar: مثال: الرمي، البريدج
hi: उदा: रम्मी, ब्रिज

source: Players
ar: اللاعبون
hi: खिलाड़ी

source: Add
ar: إضافة
hi: जोड़ें

# pleaseEnterName
source: Please enter a name
ar: الرجاء إدخال اسم
hi: कृपया नाम दर्ज करें

# atLeast2PlayersRequired
source: At least 2 players are required
ar: يلزم لاعبان على الأقل
hi: कम से कम 2 खिलाड़ी आवश्यक हैं

# playerNumber
source: Player {index}
ar: اللاعب {index}
hi: खिलाड़ी {index}

# selectPlayer
source: Select a player...
ar: اختر لاعباً...
hi: एक खिलाड़ी चुनें...

source: Clear
ar: مسح
hi: साफ़ करें

source: Remove
ar: إزالة
hi: हटाएं

source: Create game
ar: إنشاء لعبة
hi: खेल बनाएं

source: Game
ar: اللعبة
hi: खेल

source: Edit game
hi: गेम संपादित करें

# editGameDialogTitle
source: Edit game
hi: गेम संपादित करें

source: Game settings
hi: गेम सेटिंग्स

source: Remove player
hi: खिलाड़ी हटाएं

# addPlayerToGame
source: Add player
hi: खिलाड़ी जोड़ें

# warningRemovePlayer
source: Warning! Removing this player will delete all their scores from this game. This action is irreversible.
hi: चेतावनी! इस खिलाड़ी को हटाने से इस गेम से उनके सभी स्कोर हट जाएंगे। यह क्रिया अपरिवर्तनीय है।

# confirmRemovePlayer
source: Do you really want to remove {playerName} from this game?
hi: क्या आप वाकई इस गेम से {playerName} को हटाना चाहते हैं?

# playerRemoved
source: Player removed from game
hi: खिलाड़ी गेम से हटा दिया गया

source: Delete last round
ar: حذف الجولة الأخيرة
hi: अंतिम राउंड हटाएं

source: Confirm
ar: تأكيد
hi: पुष्टि करें

# confirmDeleteLastRound
source: Delete the last round?
ar: حذف الجولة الأخيرة؟
hi: अंतिम राउंड हटाएं?

# noPlayersInGame
source: No players in this game
ar: لا يوجد لاعبون في هذه اللعبة
hi: इस खेल में कोई खिलाड़ी नहीं

source: Round
ar: الجولة
hi: राउंड

source: Add round
ar: إضافة جولة
hi: राउंड जोड़ें

source: Score
ar: النتيجة
hi: स्कोर

source: Enter score
ar: أدخل النتيجة
hi: स्कोर दर्ज करें

source: Appearance
ar: المظهر
hi: रूप-रंग

source: Light
ar: فاتح
hi: हल्का

source: Dark
ar: داكن
hi: गहरा

source: System
ar: النظام
hi: सिस्टम

source: Screen
ar: الشاشة
hi: स्क्रीन

source: Keep screen awake
ar: إبقاء الشاشة مضاءة
hi: स्क्रीन को जगाए रखें

# keepScreenAwakeDescription
source: Prevents the screen from sleeping during a game
ar: يمنع الشاشة من الإطفاء أثناء اللعبة
hi: खेल के दौरान स्क्रीन को स्लीप से रोकता है

source: Backup
ar: النسخ الاحتياطي
hi: बैकअप

source: Export database
ar: تصدير قاعدة البيانات
hi: डेटाबेस निर्यात करें

# exportDatabaseDescription
source: Save all your games to a file
ar: احفظ جميع ألعابك في ملف
hi: अपने सभी खेलों को एक फ़ाइल में सहेजें

source: Database exported to:
ar: تم تصدير قاعدة البيانات إلى:
hi: डेटाबेस यहां निर्यात किया गया:

source: Error during export:
ar: خطأ أثناء التصدير:
hi: निर्यात के दौरान त्रुटि:

source: Import database
ar: استيراد قاعدة البيانات
hi: डेटाबेस आयात करें

# importDatabaseDescription
source: Restore your games from a backup file
ar: استعد ألعابك من ملف نسخة احتياطية
hi: बैकअप फ़ाइल से अपने खेलों को पुनर्स्थापित करें

source: Confirmation
ar: التأكيد
hi: पुष्टि

# importWarning
source: Importing will replace all your current data. An automatic backup will be created before import. Do you want to continue?
ar: سيؤدي الاستيراد إلى استبدال جميع بياناتك الحالية. سيتم إنشاء نسخة احتياطية تلقائية قبل الاستيراد. هل تريد المتابعة؟
hi: आयात करने से आपका सभी वर्तमान डेटा बदल जाएगा। आयात से पहले एक स्वचालित बैकअप बनाया जाएगा। क्या आप जारी रखना चाहते हैं?

source: Import
ar: استيراد
hi: आयात करें

source: Database imported successfully
ar: تم استيراد قاعدة البيانات بنجاح
hi: डेटाबेस सफलतापूर्वक आयात किया गया

source: Import successful
ar: نجح الاستيراد
hi: आयात सफल

# importSuccessMessage
source: The database has been imported successfully. The application will now close. Please reopen it to see the new data.
ar: تم استيراد قاعدة البيانات بنجاح. سيتم إغلاق التطبيق الآن. يرجى فتحه مرة أخرى لرؤية البيانات الجديدة.
hi: डेटाबेस सफलतापूर्वक आयात किया गया है। एप्लिकेशन अब बंद हो जाएगी। नया डेटा देखने के लिए कृपया इसे फिर से खोलें।

source: OK
ar: موافق
hi: ठीक है

source: Error during import:
ar: خطأ أثناء الاستيراد:
hi: आयात के दौरान त्रुटि:

source: No players
ar: لا يوجد لاعبون
hi: कोई खिलाड़ी नहीं

# playersListSummary
source: {count, plural, =0{No players} =1{1 player: {names}} other{{count} players: {names}}}
hi: {count, plural, =0{कोई खिलाड़ी नहीं} =1{1 खिलाड़ी: {names}} other{{count} खिलाड़ी: {names}}}

# playersAppearMessage
source: Players will appear here once you have created games
ar: سيظهر اللاعبون هنا بمجرد إنشاء الألعاب
hi: जब आप खेल बनाएंगे तो खिलाड़ी यहां दिखाई देंगे

# gamesCount
source: {count, plural, =0{0 games} =1{1 game} other{{count} games}}
ar: {count, plural, =0{0 لعبة} =1{لعبة واحدة} =2{لعبتان} other{{count} لعبة}}
hi: {count, plural, =0{0 खेल} =1{1 खेल} other{{count} खेल}}

# winsCount
source: {count, plural, =0{0 wins} =1{1 win} other{{count} wins}}
ar: {count, plural, =0{0 فوز} =1{فوز واحد} =2{فوزان} other{{count} فوز}}
hi: {count, plural, =0{0 जीत} =1{1 जीत} other{{count} जीत}}

source: Change color
ar: تغيير اللون
hi: रंग बदलें

source: Rename player
ar: إعادة تسمية اللاعب
hi: खिलाड़ी का नाम बदलें

source: New name
ar: الاسم الجديد
hi: नया नाम

# playerRenamedTo
source: Player renamed to "{name}"
ar: تمت إعادة تسمية اللاعب إلى "{name}"
hi: खिलाड़ी का नाम "{name}" रखा गया

source: Delete player
ar: حذف اللاعب
hi: खिलाड़ी हटाएं

# confirmDeletePlayer
source: Do you really want to delete "{name}"? This player will be removed from all {count} game(s).
ar: هل تريد حقاً حذف "{name}"؟ سيتم إزالة هذا اللاعب من جميع {count} لعبة (ألعاب).
hi: क्या आप वाकई "{name}" को हटाना चाहते हैं? यह खिलाड़ी सभी {count} खेल(खेलों) से हटा दिया जाएगा।

# playerDeleted
source: Player "{name}" deleted
ar: تم حذف اللاعب "{name}"
hi: खिलाड़ी "{name}" हटाया गया

# chooseColor
source: Choose a color
ar: اختر لوناً
hi: रंग चुनें

source: No game types
ar: لا توجد أنواع ألعاب
hi: कोई खेल प्रकार नहीं

# predefined
source: Default
ar: افتراضي
hi: डिफ़ॉल्ट

source: Edit
ar: تعديل
hi: संपादित करें

source: New type
ar: نوع جديد
hi: नया प्रकार

source: Edit type
ar: تعديل النوع
hi: प्रकार संपादित करें

source: New game type
ar: نوع لعبة جديد
hi: नया खेल प्रकार

source: Game type name
ar: اسم نوع اللعبة
hi: खेल प्रकार का नाम

source: Icon:
ar: الأيقونة:
hi: आइकन:

source: Color:
ar: اللون:
hi: रंग:

# chooseIcon
source: Choose an icon
ar: اختر أيقونة
hi: आइकन चुनें

source: Name is required
ar: الاسم مطلوب
hi: नाम आवश्यक है

source: Create
ar: إنشاء
hi: बनाएं

source: Ranking
ar: الترتيب
hi: रैंकिंग

source: No current game
ar: لا توجد لعبة حالية
hi: कोई वर्तमान खेल नहीं

source: No scores recorded
ar: لم يتم تسجيل نتائج
hi: कोई स्कोर रिकॉर्ड नहीं किया गया

source: Player Statistics
ar: إحصائيات اللاعب
hi: खिलाड़ी सांख्यिकी

source: No statistics available
ar: لا توجد إحصائيات متاحة
hi: कोई सांख्यिकी उपलब्ध नहीं

source: Games played
ar: الألعاب الملعوبة
hi: खेले गए खेल

source: Wins
ar: الانتصارات
hi: जीत

source: Win rate
ar: معدل الفوز
hi: जीत दर

source: Overall Statistics
ar: الإحصائيات العامة
hi: समग्र सांख्यिकी

source: By game type
ar: حسب نوع اللعبة
hi: खेल प्रकार के अनुसार

source: Rate
ar: المعدل
hi: दर

# version
source: Version 1.0.0
ar: الإصدار 1.0.1
hi: संस्करण 1.0.0

# appDescription
source: Score management application for your game sessions by Vincent Moreau
ar: تطبيق إدارة النتائج لجلسات الألعاب الخاصة بك من Vincent Moreau
hi: Vincent Moreau द्वारा आपके गेम सत्रों के लिए स्कोर प्रबंधन एप्लिकेशन

source: Features
ar: الميزات
hi: विशेषताएं

# featureDifferentGameTypes
source: Different game types
ar: أنواع ألعاب مختلفة
hi: विभिन्न खेल प्रकार

# featurePlayerManagement
source: Player management
ar: إدارة اللاعبين
hi: खिलाड़ी प्रबंधन

# featureDetailedStatistics
source: Detailed statistics
ar: إحصائيات تفصيلية
hi: विस्तृत सांख्यिकी

# featureCustomization
source: Customization
ar: التخصيص
hi: अनुकूलन

# featureDarkLightTheme
source: Dark/light theme
ar: الوضع الداكن/الفاتح
hi: गहरा/हल्का थीम

source: Credits
ar: الاعتمادات
hi: श्रेय

# appIconCredit
source: App icon
ar: أيقونة التطبيق
hi: ऐप आइकन

# selectPlayerDialogTitle
source: Select a player
ar: اختر لاعباً
hi: एक खिलाड़ी चुनें

source: Search
ar: بحث
hi: खोजें

source: Create new player
ar: إنشاء لاعب جديد
hi: नया खिलाड़ी बनाएं

source: New player name
ar: اسم اللاعب الجديد
hi: नए खिलाड़ी का नाम

source: No players found
ar: لم يتم العثور على لاعبين
hi: कोई खिलाड़ी नहीं मिला

# allPlayersSelected
source: All players have been selected
ar: تم اختيار جميع اللاعبين
hi: सभी खिलाड़ी चुने जा चुके हैं

source: Close
ar: إغلاق
hi: बंद करें
